flashcard_app/app/controllers/flashcards_controller.rb

SELECT "flashcards".* FROM "flashcards"
---
  def index
    # if current_user
    @flashcards = Flashcard.all

INSERT INTO "flashcards" ("user_id", "question", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["question", "postman question"], ["answer", "postman answer"], ["created_at", "2018-06-11 00:01:35.828593"], ["updated_at", "2018-06-11 00:01:35.828593"]]
---
  def create
    @flashcard = Flashcard.new(flashcard_params)

    if @flashcard.save

UPDATE "flashcards" SET "question" = $1, "answer" = $2, "updated_at" = $3 WHERE "flashcards"."id" = $4  [["question", "postman question 12 edited"], ["answer", "postman answer 12 edited"], ["updated_at", "2018-06-11 00:02:40.873825"], ["id", 12]]
---
  def update
    if @flashcard.update(flashcard_params)

DELETE FROM "flashcards" WHERE "flashcards"."id" = $1  [["id", 6]]
---
  def destroy
    @flashcard.destroy

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_flashcard
      @flashcard = Flashcard.find(params[:id])